---
type: CurveByPointsArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# CurveByPointsArray

`Autodesk.Revit.DB.CurveByPointsArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CurveByPointsArray | — | `public CurveByPointsArray ()` |
| Method | Append | — | `public virtual void Append ( CurveByPoints item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual CurveByPointsArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( CurveByPoints item , int index )` |
| Method | ReverseIterator | — | `public virtual CurveByPointsArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual CurveByPoints this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |